public class chessBoard {
//    Задача 4. (*) Напечатайте на экране шахматную доску размером 8х8. 0 - белая клеточка, 1 - черная.
//    Левая верхняя клеточка должна быть 0, левая нижняя - 1.
    public static void main(String[] args) {

        int n = 0;
        int m = 0;

        while (n < 8){
            while (m < 8){
                System.out.println();
                n = 0;
                m++;
            }
            System.out.println("Done");
        }

    }
}
